/**************************************************************************
                        БЛОК ИНИЦИАЛИЗАЦИИ ПЕРЕМЕННЫХ
**************************************************************************/
//задаем начальное количество жизней
var quantityLifes = 0;


/**************************************************************************
                            БЛОК ВЫЗОВА ФУНКЦИЙ
**************************************************************************/
//создаем информационный блок с таймером
creatureInfoBlock();
//запускаем таймер
timerGame();
//создаем блок с жизнями
creatureLifes();

//создаем корабль
creatureShip();
//делаем его подвижным (вешаем обработчик события на клавиатуру)
addEventListener('keydown', moveRect);

//создаем астероиды
asteroids();
//приводим все астероиды в движение
getAsteroids();

//каждые 1,5 секунды 
setInterval(() => {
    if (status != 'over') {
        console.log(status);
        //очищаем массив с астероидов
        allAsteroids = [];
        //создаем астероиды
        asteroids();
        //приводим их в движение
        getAsteroids();
    }
}, 1500);