/*************************************************************************
                    ПОЛУЧЕНИЕ ЭЛЕМЕНТОВ СО СТРАНИЦЫ
*************************************************************************/
//блок с карточками
let cardsField = document.querySelector(".cards"),
//блок окончания игры
resetBlock = document.querySelector("#win"),
//текст блока
resetText = document.querySelector('#text'),
//кнопку перезапуска игры
resetBtn = document.querySelector("#reset-btn");

/*************************************************************************
                    ИНИЦИАЛИЗАЦИЯ ПЕРЕМЕННЫХ
*************************************************************************/
//задаем количество карточек
let countCards = 16,
//создаем массив для хранения номера изображения карточек
images = [],
//создаем переменную для хранения количсетва удаленных карточек
deletedCard = 0,
//создаем пустой массив для хранения выбранных карточек
selected = [],
//создаем переменную для отслеживания уровня игры
level = 1;