/*************************************************************************
                    ПОЛУЧЕНИЕ ЭЛЕМЕНТОВ СО СТРАНИЦЫ
*************************************************************************/
//блок с карточками
let cardsField = document.querySelector("#cards");
//блок окончания игры
let resetBlock = document.querySelector("#reset");
//кнопку перезапуска игры
let resetBtn = document.querySelector("#reset-btn");

/*************************************************************************
                    ИНИЦИАЛИЗАЦИЯ ПЕРЕМЕННЫХ
*************************************************************************/
//задаем количество карточек
let countCards = 16;
//создаем массив для хранения номера изображения карточек
let images = [];
//создаем переменную для хранения количсетва удаленных карточек
let deletedCard = 0;
//создаем пустой массив для хранения выбранных карточек
let selected = [];